*** hooks advice
hookifysignalsignal
therapy
hookifysignal
therapy
hookify
el-patch
signal
org-dp


  * `org-dp-create': create a new Org element by building its internal representation
   
  * `org-dp-rewire': modify (and maybe transform) an existing Org element by changing its internal representation
   
  * `org-dp-map': map elements in a buffer and 'rewire' them
   
and 1 command as generic UI

  * `org-dp-prompt': universal function for getting user info

The following more 'private' functions and commands are used by the core/UI functions, but might be useful by themselves

  * `org-dp-contents': get content of (local) element
   
  * `org-dp-in': return position-info if inside element, nil otherwise (not yet implemented)
   
  * `org-dp-prompt-all': workhorse function for prompting the user
   
  * `org-dp-prompt-for-src-block-props': prompt user for src-block properties (adapted from ob-core.el)
   
Note that the src-block parameters are appended to the src-block's headline. If you rather want them as separate #+header: lines on top
of the src-block you can use `org-dp-toggle-headers' from org-dp-lib.el for swapping headers and parameters.

 Examples

 Create Src-Block

#+BEGIN_SRC emacs-lisp
  (org-dp-create 'src-block nil nil
                 '(:name "ex1" :header (":cache no" ":noweb yes"))
                 :language "picolisp"
                 :preserve-indent 1
                 :parameters ":results value"
                 :value "(+ 2 2)")
#+END_SRC

#+RESULTS:
: #+NAME: ex1
: #+HEADER: :noweb yes
: #+HEADER: :cache no
: #+BEGIN_SRC picolisp :results value
: (+ 2 2)
: #+END_SRC

#+NAME: ex1
#+HEADER: :noweb yes
#+HEADER: :cache no
#+BEGIN_SRC picolisp :results value
(+ 2 2)
#+END_SRC

 Transform Src-Block into Example Block

#+NAME: ex2
#+HEADER: :results raw
#+BEGIN_SRC emacs-lisp  :exports both
 (org-dp-rewire 'example-block) 
#+END_SRC

#+results: ex2
#+BEGIN_EXAMPLE
(org-dp-rewire 'example-block) 
#+END_EXAMPLE

 Transform Src-Block into Headline

#+NAME: ex2
#+HEADER: :results raw
#+BEGIN_SRC emacs-lisp :cache no :noweb yes
  (org-dp-rewire 'headline
                 (lambda (_cont_ elem)
                   (concat
                    "This was an\n\n"
                    (org-element-property :language elem)
                    "\n\nsrc-block with header args\n\n"
                    (org-element-property :parameters elem)
                    "\n\nbefore."))
                    'append '(:name "transformed Src-Block")
                    :level 1
                    :title (lambda (_old_ elem)
                             (mapconcat
                              'upcase
                              (split-string
                               (car
                                (org-element-property :header elem))
                                ":")
                              " "))
                    :tags (lambda (_old_ elem)
                            (list (org-element-property :name elem)))
                    :header nil)
#+END_SRC

#+NAME: transformed Src-Block
